vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN556S_DFP.pdsc
    <condition id="component.els_pkc.signature.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN556S.internal_condition">
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.standalone_gdet.condition_id">
      <require condition="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN556S.internal_condition">
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_els_header_only"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.static_lib.mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.toolchain.condition_id">
      <require condition="allOf.device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN556S.internal_condition">
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_els.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.trng, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.trng, device=MCXN556S.internal_condition">
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_rng4.condition_id">
      <require condition="allOf.component.els_pkc.trng, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.trng, device=MCXN556S.internal_condition">
      <require Cclass="MCXN556S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MCXN556S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXN556S.internal_condition">
      <require condition="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <accept condition="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
    </condition>
    <condition id="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcxw_flash_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.flash_nand_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, device=MCXN556S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.anyOf=driver.port, driver.gpio, device=MCXN556S.internal_condition"/>
    </condition>
