vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN556S_DFP.pdsc
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN556S.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.MCXN556S.internal_condition"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.lpuart_adapter, driver.lpflexcomm, driver.lpflexcomm_lpuart, driver.lpflexcomm_lpi2c, driver.lpflexcomm_lpspi, driver.gpio, driver.port, driver.reset, device_id=MCXN556S, device.startup, driver.common, driver.clock, driver.mcx_spc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, driver.lpflexcomm, driver.lpflexcomm_lpuart, driver.lpflexcomm_lpi2c, driver.lpflexcomm_lpspi, driver.gpio, driver.port, driver.reset, device_id=MCXN556S, device.startup, driver.common, driver.clock, driver.mcx_spc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require condition="device_id.MCXN556S.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_spc"/>
      <require condition="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert.internal_condition"/>
      <accept condition="allOf.utility.debug_console_lite, utility.assert_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, utility.assert_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MCXN556S.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXN556S_system"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXN556S.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXN556S.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXN556S_header"/>
      <require condition="device.MCXN556S.internal_condition"/>
    </condition>
