vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN556S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="button" Cversion="1.0.0" condition="component.button.condition_id">
      <description>Component button</description>
      <files>
        <file category="header" name="components/button/fsl_component_button.h" projectpath="component/button"/>
        <file category="sourceC" name="components/button/fsl_component_button.c" projectpath="component/button"/>
        <file category="include" name="components/button/"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="cmsis_drivers" Cversion="2.0.0" condition="component.cmsis_drivers.condition_id">
      <description>CMSIS driver</description>
      <files>
        <file category="doc" name="components/cmsis_drivers/component.cmsis_drivers_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters" Cversion="2.2.0" condition="component.codec_adapters.condition_id">
      <description>Component codec adapters for multi codec</description>
      <RTE_Components_h>
#ifndef CODEC_MULTI_ADAPTERS
#define CODEC_MULTI_ADAPTERS 1
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="component.codec_i2c.condition_id">
      <description>Component codec_i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c" projectpath="codec"/>
        <file category="include" name="components/codec/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc_adapter" Cversion="1.0.0" condition="component.crc_adapter.condition_id">
      <description>Component crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter" Cversion="2.2.1" condition="component.cs42448_adapter.condition_id">
      <description>Component cs42448 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/cs42448/fsl_codec_cs42448_adapter.h" projectpath="codec/port/cs42448"/>
        <file category="sourceC" name="components/codec/port/cs42448/fsl_codec_cs42448_adapter.c" projectpath="codec/port/cs42448"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/cs42448/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter" Cversion="2.2.1" condition="component.cs42888_adapter.condition_id">
      <description>Component cs42888 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/cs42888/fsl_codec_cs42888_adapter.h" projectpath="codec/port/cs42888"/>
        <file category="sourceC" name="components/codec/port/cs42888/fsl_codec_cs42888_adapter.c" projectpath="codec/port/cs42888"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/cs42888/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter" Cversion="1.0.0" condition="component.ctimer_adapter.condition_id">
      <description>Component ctimer_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_CTIMER
#define TIMER_PORT_TYPE_CTIMER 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ctimer.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter" Cversion="2.2.0" condition="component.da7212_adapter.condition_id">
      <description>Component da7212 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/da7212/fsl_codec_da7212_adapter.h" projectpath="codec/port/da7212"/>
        <file category="sourceC" name="components/codec/port/da7212/fsl_codec_da7212_adapter.c" projectpath="codec/port/da7212"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/da7212/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT25Fxxxx" Cversion="1.0.0" condition="component.eeprom_AT25Fxxxx.condition_id">
      <description>Component eeprom_at25fxxxx</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_AT25Fxxxx_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT45DBxxxx" Cversion="1.0.0" condition="component.eeprom_AT45DBxxxx.condition_id">
      <description>Component eeprom_at45dbxxxx</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_AT45DBxxxx_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_InternalFlash" Cversion="1.0.0" condition="component.eeprom_InternalFlash.condition_id">
      <description>Component eeprom_internalflash</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_InternalFlash_dummy.txt"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_main" Cversion="1.9.0" condition="component.els_pkc.condition_id">
      <description>Component els_pkc of Crypto Lib</description>
      <files>
        <file category="header" name="components/els_pkc/src/inc/mcuxCl_clns.h" projectpath="component/els_pkc/src/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_aead" Cversion="1.9.0" condition="component.els_pkc.aead.condition_id">
      <description>Component els_pkc.aead</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAead/src/mcuxClAead.c" projectpath="component/els_pkc/src/comps/mcuxClAead/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/mcuxClAead.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/mcuxClAead_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/mcuxClAead_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/mcuxClAead_Types.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/internal/mcuxClAead_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/internal/mcuxClAead_Descriptor.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAead/inc/internal/mcuxClAead_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClAead/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClAead/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClAead/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_aead_modes" Cversion="1.9.0" condition="component.els_pkc.aead_modes.condition_id">
      <description>Component els_pkc.aead_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_AesCcm.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_AesCcmEngine.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_AesGcm.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_AesGcmEngine.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_Modes.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_Multipart.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Els_Oneshot.c" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/mcuxClAeadModes.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/mcuxClAeadModes_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Els_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Els_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Els_Types.h" projectpath="component/els_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClAeadModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_aes" Cversion="1.9.0" condition="component.els_pkc.aes.condition_id">
      <description>Component aes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAes/src/mcuxClAes_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClAes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes_Types.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Wa.h" projectpath="component/els_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClAes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_buffer" Cversion="1.9.0" condition="component.els_pkc.buffer.condition_id">
      <description>Component buffer</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClBuffer/src/mcuxClBuffer.c" projectpath="component/els_pkc/src/comps/mcuxClBuffer/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Impl.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Pointer.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/internal/mcuxClBuffer_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClBuffer/inc/internal/mcuxClBuffer_Internal_Pointer.h" projectpath="component/els_pkc/src/comps/mcuxClBuffer/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_cipher" Cversion="1.9.0" condition="component.els_pkc.cipher.condition_id">
      <description>Component els_pkc.cipher</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipher/src/mcuxClCipher.c" projectpath="component/els_pkc/src/comps/mcuxClCipher/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Types.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClCipher/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCipher/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_cipher_modes" Cversion="1.9.0" condition="component.els_pkc.cipher_modes.condition_id">
      <description>Component els_pkc.cipher</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Common_Helper.c" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Crypt_Els_Modes.c" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Els_Aes.c" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Els_AesEngine.c" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Els_Aes_Internal.c" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common_Wa.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Els_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Els_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Els_Types.h" projectpath="component/els_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_common" Cversion="1.9.0" condition="component.els_pkc.common.condition_id">
      <description>Component els pkc common</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/common/src/mcuxClOscca_CommonOperations.c" projectpath="component/els_pkc/src/comps/common/src"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_Memory.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_PlatformTypes.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_Types.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/common/inc/"/>
      </files>
    </component>
