vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN556S_DFP.pdsc
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_ecc" Cversion="1.9.0" condition="component.els_pkc.ecc.condition_id">
      <description>Component els_pkc.ecc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Constants.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_GenerateProtocolDescriptor.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_Internal_BlindedSecretKeyGen.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_Internal_BlindedSecretKeyGen_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateKeyPair.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateKeyPair_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateSignature.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateSignatureMode.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateSignature_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_InitPrivKeyInputMode.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_CalcHashModN.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_CalcHashModN_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_DecodePoint_Ed25519.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_DecodePoint_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_EncodePoint.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_SetupEnvironment.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_SignatureMechanisms.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_VerifySignature.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_BlindedScalarMult.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Convert_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_GenerateMultiplicativeBlinding.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_InterleaveScalar.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_InterleaveTwoScalars.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Interleave_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_PointComparison_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_RecodeAndReorderScalar.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_SetupEnvironment.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_SetupEnvironment_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Types.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_MontDH_GenerateKeyPair.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_MontDH_KeyAgreement.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_DhSetupEnvironment.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_MontDhX.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_MontDhX_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_SecureScalarMult_XZMontLadder.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_SecureScalarMult_XZMontLadder_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_FixScalarMult.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainFixScalarMult25519.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainPtrSelectComb.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainPtrSelectML.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainVarScalarMult.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmetic.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmetic_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmeticEd25519.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmeticEd25519_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointSubtraction_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointValidation_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PrecPointImportAndValidate.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_VarScalarMult.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_VarScalarMult_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_BlindedSecretKeyGen.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_BlindedSecretKeyGen_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_GenerateKeyPair.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_SetupEnvironment.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_ConvertPoint_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointArithmetic.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointArithmetic_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointCheck.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointCheck_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointMult.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_SecurePointMult_CoZMontLadder.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_SecurePointMult_CoZMontLadder_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_SetupEnvironment.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_KeyGen.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_KeyGen_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_PointMult.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_PointMult_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Sign.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Sign_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Verify.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Verify_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClEcc/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_GenerateKeyPair_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_GenerateSignature_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_Internal_CalcHashModN_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_Internal_DecodePoint_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_Convert_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_Interleave_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_PointComparison_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_SetupEnvironment_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Mont_Internal_MontDhX_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Mont_Internal_SecureScalarMult_XZMontLadder_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointArithmeticEd25519_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointSubtraction_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointArithmetic_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointValidation_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_VarScalarMult_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Types.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_WeierECC_Internal_BlindedSecretKeyGen_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_ConvertPoint_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_PointArithmetic_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_PointCheck_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_SecurePointMult_CoZMontLadder_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_KeyGen_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_PointMult_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Sign_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Verify_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_ECDH_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_ECDSA_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_ECDSA_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_EdDSA_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_EdDSA_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_EdDSA_Internal_Hash.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_PkcWaLayout.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_Random.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_SecurePointSelect.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_UPTRT_access.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Mont_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Mont_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Mont_Internal_PkcWaLayout.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_TwEd_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_TwEd_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_TwEd_Internal_PkcWaLayout.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_WeierEcc_KeyGenerate_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal_FP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal_PkcWaLayout.h" projectpath="component/els_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClEcc/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClEcc/inc/internal/"/>
      </files>
    </component>
