vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN556S_DFP.pdsc
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_oscca" Cversion="1.9.0" condition="component.els_pkc.oscca.condition_id">
      <description>Component els_pkc.oscca</description>
      <files>
        <file category="doc" name="components/els_pkc/component.els_pkc.oscca_dummy.txt"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_oscca_aeadmodes" Cversion="1.9.0" condition="component.els_pkc.oscca_aeadmodes.condition_id">
      <description>Component els_pkc.oscca_aeadmodes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_Ccm_Common.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_Constants.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_EngineCcm.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_SkeletonCcm.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_SM4Ctr.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_SM4_Multipart.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/src/mcuxClOsccaAeadModes_SM4_OneShot.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/mcuxClOsccaAeadModes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/mcuxClOsccaAeadModes_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal/mcuxClOsccaAeadModes_Internal_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal/mcuxClOsccaAeadModes_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal/mcuxClOsccaAeadModes_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaAeadModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_oscca_ciphermodes" Cversion="1.9.0" condition="component.els_pkc.oscca_ciphermodes.condition_id">
      <description>Component els_pkc.oscca_ciphermodes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/src/mcuxClOsccaCipherModes_Constants.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/src/mcuxClOsccaCipherModes_SM4_Crypt.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/src/mcuxClOsccaCipherModes_SM4_Crypt_Internal.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/mcuxClOsccaCipherModes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/mcuxClOsccaCipherModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal/mcuxClOsccaCipherModes_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal/mcuxClOsccaCipherModes_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal/mcuxClOsccaCipherModes_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaCipherModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN556S els_pkc" Cgroup="els_pkc_oscca_macmodes" Cversion="1.9.0" condition="component.els_pkc.oscca_macmodes.condition_id">
      <description>Component els_pkc.oscca_macmodes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/src/mcuxClOsccaMacModes.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/src/mcuxClOsccaMacModes_CBCMac.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/src/mcuxClOsccaMacModes_CMac.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/src/mcuxClOsccaMacModes_Helper.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/src/mcuxClOsccaMacModes_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/src/mcuxClOsccaMacModes_Modes.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/mcuxClOsccaMacModes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/mcuxClOsccaMacModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/mcuxClOsccaMacModes_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/mcuxClOsccaMacModes_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/mcuxClOsccaMacModes_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/mcuxClOsccaMacModes_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/mcuxClOsccaMacModes_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/mcuxClOsccaMacModes_SM4_CBCMAC.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/mcuxClOsccaMacModes_SM4_CMAC.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/mcuxClOsccaMacModes_Types.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaMacModes/inc/internal/"/>
      </files>
    </component>
